Repository: AmitYuLife/yulife-app-storybook
Catalog: targets/YuWatch/Localizable.xcstrings
Source language: en
Languages: es_us, ja_jp

# common.close
source: Close
es_us: Cerrar
ja_jp: 閉じる

# common.retry
source: Retry
es_us: Reintentar
ja_jp: 再試行

# common.steps
source: steps
es_us: pasos

# screens.challenge_cancel.confirm
source: Confirm
es_us: Confirme
ja_jp: 確定

# screens.challenge_cancel.label
source: Are you sure you want to cancel your challenge?
es_us: ¿Estás seguro de que quieres cancelar tu reto?
ja_jp: 本当にチャレンジをキャンセルしますか?

# screens.challenge_failed.explanation
source: You were only %d steps away from earning %d YuCoin!
es_us: ¡Estabas a sólo %d pasos de ganar %d YuCoin!
ja_jp: %dYuCoin獲得まであと%d歩でした!

# screens.challenge_list.error
source: Something went wrong!
es_us: ¡Algo salió mal!
ja_jp: エラーが発生しました

# screens.challenge_list.title
source: Challenges
es_us: Retos
ja_jp: チャレンジ

# screens.challenge_preview.buttonError
source: Ooops!
es_us: ¡Ay!
ja_jp: エラーが発生しました

# screens.challenge_preview.buttonText
source: Take challenge
es_us: Acepta el reto
ja_jp: チャレンジする

# screens.challenge_start_fail.errors.challenge_on_phone
source: There's already a challenge in progress on your phone!
es_us: ¡Ya hay un reto en curso en tu teléfono!
ja_jp: ご使用のデバイスでは、すでにチャレンジが進行中です!

# screens.challenge_start_fail.errors.generic_error
source: Something's gone wrong!
es_us: ¡Algo ha salido mal!
ja_jp: エラーが発生しました

# screens.challenge_start_fail.errors.has_unity_left
source: Check your phone to continue!
es_us: ¡Revisa tu teléfono para continuar!
ja_jp: 続行するには、デバイスをご確認ください

# screens.challenge_start_fail.errors.no_challenges_left
source: Already completed all available challenges for today
es_us: Ya has completado todos los retos disponibles para hoy
ja_jp: 今日のチャレンジはすべて達成しています

# screens.challenge_submit_error.message
source: There was a problem submitting your results
es_us: Ha habido un problema al enviar tus resultados
ja_jp: 結果の送信中に問題が発生しました

# screens.challenge_success.youGot
source: You earned
es_us: Has ganado

# screens.home.yucoin_today
source: YuCoin Today
es_us: YuCoin de hoy

# screens.offline.label
source: You're offline!
es_us: ¡Estás desconectado!
ja_jp: デバイスはオフラインです

# screens.offline.text
source: Check your network
es_us: Comprueba tu red
ja_jp: ネットワークをご確認ください

# screens.onboarding.notAvailable
source: The Apple Watch YuLife app will be available soon! Watch… this space!
es_us: La app YuLife para Apple Watch estará disponible en breve. Atento... ¡a este espacio!
ja_jp: Apple Watch専用のYuLifeアプリは近日よりご利用いただけます。

# screens.onboarding.open_on_phone
source: Please open the YuLife app on your phone.
es_us: Por favor, abre la app YuLife en tu teléfono.
ja_jp: スマートフォンのYuLifeアプリを開いてください。

# screens.onboarding.pedometer
source: Please grant the app permission track your steps!
es_us: Por favor, concede a la app permiso para seguir tus pasos.
ja_jp: アプリで歩数の記録に関する設定を許可してください。

# screens.onboarding.systemPermissionNeeded
source: Please enable the Motion & Fitness permission in Settings
es_us: Por favor, activa el permiso de Condición y Actividad Física en Ajustes
ja_jp: 設定でモーションとフィットネスを有効化してください。

# screens.settings.logout
source: Log out
es_us: Cerrar sesión
ja_jp: ログアウト

# screens.settings.logout_confirm
source: Are you sure you want to log out?
es_us: ¿Seguro que quieres cerrar la sesión?
ja_jp: 本当にログアウトしますか?

# screens.settings.title
source: Settings
es_us: Ajustes
ja_jp: 設定
